#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.website.data.aws_canonical_user_id.default[0]: Reading...
module.www-website.data.aws_canonical_user_id.default[0]: Reading...
aws_route53_zone.this: Refreshing state... [id=Z048504419NDW43VP1NZI]
module.website.data.aws_partition.current[0]: Reading...
module.www-website.data.aws_partition.current[0]: Reading...
module.www-website.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.website.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.website.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=0415ac49d2dbae53693985f648ef7b9ed41476f5aca8c9cafc28423e8d578bd3]
module.www-website.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=0415ac49d2dbae53693985f648ef7b9ed41476f5aca8c9cafc28423e8d578bd3]
module.acm_request_certificate.aws_acm_certificate.default[0]: Refreshing state... [id=arn:aws:acm:us-east-1:072105303426:certificate/b89f103c-57a2-4aa5-bd9c-bfed2eb09df0]
module.acm_request_certificate.data.aws_route53_zone.default["xyz"]: Reading...
module.www-website.aws_s3_bucket.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.acm_request_certificate.data.aws_route53_zone.default["kq4afy.xyz"]: Reading...
module.website.aws_s3_bucket.default[0]: Refreshing state... [id=kq4afy.xyz]
module.acm_request_certificate.data.aws_route53_zone.default["kq4afy.xyz"]: Read complete after 0s [id=Z048504419NDW43VP1NZI]
module.acm_request_certificate.data.aws_route53_zone.default["xyz"]: Read complete after 0s [id=Z048504419NDW43VP1NZI]
module.acm_request_certificate.aws_route53_record.default["*.kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI__f4debdcb895fe9f5481480281fa1a9e1.kq4afy.xyz._CNAME]
module.acm_request_certificate.aws_route53_record.default["kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI__f4debdcb895fe9f5481480281fa1a9e1.kq4afy.xyz._CNAME]
module.website.aws_s3_bucket_acl.default[0]: Refreshing state... [id=kq4afy.xyz,private]
module.website.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=kq4afy.xyz]
module.website.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=kq4afy.xyz]
module.website.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.website.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=kq4afy.xyz]
module.website.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=1132004489]
module.website.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.website.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=1132004489]
module.www-website.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.www-website.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.www-website.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.www-website.aws_s3_bucket_website_configuration.redirect[0]: Refreshing state... [id=www.kq4afy.xyz]
module.www-website.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=1132004489]
module.www-website.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=www.kq4afy.xyz]
module.www-website.aws_s3_bucket_acl.default[0]: Refreshing state... [id=www.kq4afy.xyz,private]
module.www-website.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.www-website.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=1132004489]
module.website.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2022-12-08T16:20:05Z]
module.website.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=kq4afy.xyz]
module.www-website.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2022-12-08T16:20:05Z]
module.www-website.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=www.kq4afy.xyz]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.www-website.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "www.kq4afy.xyz"
        tags                        = {
            "Name"      = "kq4afy-use1-zone"
            "Namespace" = "kq4afy"
            "Stage"     = "use1"
        }
      + website_domain              = "s3-website-us-east-1.amazonaws.com"
      + website_endpoint            = "www.kq4afy.xyz.s3-website-us-east-1.amazonaws.com"
        # (10 unchanged attributes hidden)

      + website {
          + redirect_all_requests_to = "https://kq4afy.xyz"
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.website.aws_s3_bucket_website_configuration.default[0] will be created
  + resource "aws_s3_bucket_website_configuration" "default" {
      + bucket           = "kq4afy.xyz"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "/404.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jbouse, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*